zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_hal_rcc.h
/**
  ******************************************************************************
  * @file    stm32mp1xx_hal_rcc.h
  * @author  MCD Application Team
  * @brief   Header file of RCC HAL module.
  ******************************************************************************
  * @attention
  *
  * <h2><center>&copy; Copyright (c) 2019 STMicroelectronics.
  * All rights reserved.</center></h2>
  *
  * This software component is licensed by ST under BSD 3-Clause license,
  * the "License"; You may not use this file except in compliance with the
  * License. You may obtain a copy of the License at:
  *                        opensource.org/licenses/BSD-3-Clause
  *
  ******************************************************************************
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __STM32MP1xx_HAL_RCC_H
#define __STM32MP1xx_HAL_RCC_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32mp1xx_hal_def.h"

/** @addtogroup STM32MP1xx_HAL_Driver
  * @{
  */

/** @addtogroup RCC
  * @{
  */

/* Exported types ------------------------------------------------------------*/

/** @defgroup RCC_Exported_Types RCC Exported Types
  * @{
  */

/**
  * @brief  RCC PLL configuration structure definition
  */
typedef struct
{
  uint32_t PLLState;   /*!< The new state of the PLL.
                            This parameter can be a value of @ref RCC_PLL_Config                      */

  uint32_t PLLSource;  /*!< RCC_PLLSource: PLL entry clock source.
                            This parameter must be a value of @ref RCC_PLL12_Clock_Source              */

  uint32_t PLLM;       /*!< PLLM: Division factor for PLL VCO input clock.
                            This parameter must be a number between 1 and 64 */

  uint32_t PLLN;       /*!< PLLN: Multiplication factor for PLL VCO output clock
                            This parameter must be a number between:
                            Integer mode:     25 and 100 for PLL1600 (PLL1 and PLL2), 25 and 200 for PLL800
                            Fractional mode:  4 and 512 (PLL1600 and PLL800) */

  uint32_t PLLP;       /*!< PLLP: Division factor ck_pll1_p
                            This parameter must be a number between 1 and 128 */

  uint32_t PLLQ;       /*!< PLLQ: Division factor ck_pll1_q
                            This parameter must be a number between 1 and 128 */

  uint32_t PLLR;       /*!< PLLR: Division for ck_pll1_r
                            This parameter must be a number between 1 and 128 */

  uint32_t PLLRGE;     /*!< PLLRGE: PLL input frequency range for PLL3 and PLL4
                            This parameter must be a value of @ref RCC_PLL3_IF_Range and RCC_PLL4_IF_Range */

  uint32_t PLLFRACV;   /*!< PLLFRACV: Fractional Part Of The Multiplication Factor for PLL1 VCO
                            It should be a value between 0 and 8191 ((2^13)-1) */

  uint32_t PLLMODE;   /*!< PLLMODE: PLL mode used
                             This parameter must be a value of @ref RCC_PLL_Mode */

  uint32_t MOD_PER;   /*!< MOD_PER:  Modulation Period Adjustment
                             This parameter must have a value contained on @ref RCC_MOD_PER */

  uint32_t RPDFN_DIS;  /*!< RPDFN_DIS: Dithering RPDF noise control
                            This parameter must be a value of @ref RCC_RPDFN_DIS*/

  uint32_t TPDFN_DIS;  /*!< TPDFN_DIS: Dithering TPDF noise control
                            This parameter must be a value of @ref RCC_TPDFN_DIS*/

  uint32_t SSCG_MODE;  /*!< SSCG_MODE: Spread spectrum clock generator mode
                            This parameter must be a value of @ref RCC_SSCG_MODE*/

  uint32_t INC_STEP;   /*!< INC_STEP: Modulation Depth Adjustment
                            This parameter must have a value contained on @ref RCC_INC_STEP */

} RCC_PLLInitTypeDef;




typedef struct
{
  uint32_t PLL1_P_Frequency;
  uint32_t PLL1_Q_Frequency;
  uint32_t PLL1_R_Frequency;
} PLL1_ClocksTypeDef;

/**
  * @brief  RCC PLL2 Clocks structure definition => [FCH] used in UART set_config use case
  */
typedef struct
{
  uint32_t PLL2_P_Frequency;
  uint32_t PLL2_Q_Frequency;
  uint32_t PLL2_R_Frequency;
} PLL2_ClocksTypeDef;

/**
  * @brief  RCC PLL3 Clocks structure definition => [FCH] used in UART set_config use case
  */
typedef struct
{
  uint32_t PLL3_P_Frequency;
  uint32_t PLL3_Q_Frequency;
  uint32_t PLL3_R_Frequency;
} PLL3_ClocksTypeDef;


typedef struct
{
  uint32_t PLL4_P_Frequency;
  uint32_t PLL4_Q_Frequency;
  uint32_t PLL4_R_Frequency;
} PLL4_ClocksTypeDef;

/**
  * @brief  RCC Internal/External Oscillator (HSE, HSI, CSI, LSE and LSI) configuration structure definition
  */
typedef struct
{

  uint32_t OscillatorType;       /*!< The oscillators to be configured.
                                      This parameter can be a value of @ref RCC_Oscillator_Type                   */

  uint32_t HSEState;             /*!< The new state of the HSE.
                                      This parameter can be a value of @ref RCC_HSE_Config                        */

  uint32_t LSEState;             /*!< The new state of the LSE.
                                      This parameter can be a value of @ref RCC_LSE_Config                        */

  uint32_t HSIState;             /*!< The new state of the HSI.
                                      This parameter can be a value of @ref RCC_HSI_Config                        */

  uint32_t HSICalibrationValue;  /*!< The calibration trimming value.
                                      This parameter must be a number between Min_Data = 0x00 and Max_Data = 0x7F */

  uint32_t HSIDivValue;         /*!< The HSI Division value.
                                      This parameter must be a value of @ref RCC_HSI_Clock_Prescaler              */

  uint32_t LSIState;             /*!< The new state of the LSI.
                                      This parameter can be a value of @ref RCC_LSI_Config                        */

  uint32_t CSIState;             /*!< The new state of the CSI.
                                      This parameter can be a value of @ref RCC_CSI_Config */

