zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_hal_rcc.h
  uint32_t CSICalibrationValue;  /*!< The calibration trimming value.
                                      This parameter must be a number between Min_Data = 0x00 and Max_Data = 0x1F */

  RCC_PLLInitTypeDef PLL;        /*!< PLL1 structure parameters                                                    */

  RCC_PLLInitTypeDef PLL2;      /*!< PLL2 structure parameters                                                    */

  RCC_PLLInitTypeDef PLL3;      /*!< PLL3 structure parameters                                                    */

  RCC_PLLInitTypeDef PLL4;      /*!< PLL4 structure parameters                                                    */

} RCC_OscInitTypeDef;

/**
  * @brief MPU configuration structure definition.
  */
typedef struct
{
  uint32_t MPU_Clock;
  uint32_t MPU_Div;
} RCC_MPUInitTypeDef;

/**
  * @brief  AXI configuration structure definition.
  */
typedef struct
{
  uint32_t AXI_Clock;
  uint32_t AXI_Div;
} RCC_AXISSInitTypeDef;


/**
  * @brief  MCU configuration structure definition.
  */
typedef struct
{
  uint32_t MCU_Clock;
  uint32_t MCU_Div;
} RCC_MCUInitTypeDef;

/**
  * @brief  RCC MPU, MCU, AXI, AHB and APB busses clock configuration structure definition.
  */
typedef struct
{
  uint32_t                  ClockType;              /*!< The clock to be configured.
                                                         This parameter can be a value of @ref RCC_System_Clock_Type */

  RCC_MPUInitTypeDef        MPUInit;
  RCC_AXISSInitTypeDef      AXISSInit;
  RCC_MCUInitTypeDef        MCUInit;
  uint32_t                  APB4_Div;
  uint32_t                  APB5_Div;
  uint32_t                  APB1_Div;
  uint32_t                  APB2_Div;
  uint32_t                  APB3_Div;
} RCC_ClkInitTypeDef;

/**
  * @}
  */

/* Exported constants --------------------------------------------------------*/

/** @defgroup RCC_Exported_Constants RCC Exported Constants
  * @{
  */
#define DBP_TIMEOUT_VALUE              ((uint32_t)100)
#define LSE_TIMEOUT_VALUE              ((uint32_t)5000)

/** @defgroup RCC_Oscillator_Type RCC_Oscillator_Type
  * @{
  */
#define RCC_OSCILLATORTYPE_NONE        ((uint32_t)0x00000000)
#define RCC_OSCILLATORTYPE_HSE         ((uint32_t)0x00000001)
#define RCC_OSCILLATORTYPE_HSI         ((uint32_t)0x00000002)
#define RCC_OSCILLATORTYPE_LSE         ((uint32_t)0x00000004)
#define RCC_OSCILLATORTYPE_LSI         ((uint32_t)0x00000008)
#define RCC_OSCILLATORTYPE_CSI         ((uint32_t)0x00000010)

#define IS_RCC_OSCILLATORTYPE(OSCILLATOR) (((OSCILLATOR) == RCC_OSCILLATORTYPE_NONE)                           || \
                                           (((OSCILLATOR) & RCC_OSCILLATORTYPE_HSE) == RCC_OSCILLATORTYPE_HSE) || \
                                           (((OSCILLATOR) & RCC_OSCILLATORTYPE_HSI) == RCC_OSCILLATORTYPE_HSI) || \
                                           (((OSCILLATOR) & RCC_OSCILLATORTYPE_CSI) == RCC_OSCILLATORTYPE_CSI) || \
                                           (((OSCILLATOR) & RCC_OSCILLATORTYPE_LSI) == RCC_OSCILLATORTYPE_LSI) || \
                                           (((OSCILLATOR) & RCC_OSCILLATORTYPE_LSE) == RCC_OSCILLATORTYPE_LSE))
/**
  * @}
  */

/** @defgroup RCC_System_Clock_Type RCC_System_Clock_Type
  * @{
  */
#define RCC_CLOCKTYPE_NONE             ((uint32_t)0x00000000)
#define RCC_CLOCKTYPE_MPU              ((uint32_t)0x00000001)
#define RCC_CLOCKTYPE_ACLK             ((uint32_t)0x00000002)
#define RCC_CLOCKTYPE_HCLK             ((uint32_t)0x00000004)
#define RCC_CLOCKTYPE_PCLK4            ((uint32_t)0x00000008)
#define RCC_CLOCKTYPE_PCLK5            ((uint32_t)0x00000010)
#define RCC_CLOCKTYPE_PCLK1            ((uint32_t)0x00000020)
#define RCC_CLOCKTYPE_PCLK2            ((uint32_t)0x00000040)
#define RCC_CLOCKTYPE_PCLK3            ((uint32_t)0x00000080)



#define IS_RCC_CLOCKTYPETYPE(CLOCK)    (((CLOCK) == RCC_CLOCKTYPE_NONE)                               || \
                                       (((CLOCK) & RCC_CLOCKTYPE_MPU)  == RCC_CLOCKTYPE_MPU)          || \
                                       (((CLOCK) & RCC_CLOCKTYPE_ACLK)== RCC_CLOCKTYPE_ACLK)          || \
                                       (((CLOCK) & RCC_CLOCKTYPE_HCLK)  == RCC_CLOCKTYPE_HCLK)        || \
                                       (((CLOCK) & RCC_CLOCKTYPE_PCLK4) == RCC_CLOCKTYPE_PCLK4)       || \
                                       (((CLOCK) & RCC_CLOCKTYPE_PCLK5) == RCC_CLOCKTYPE_PCLK5)       || \
                                       (((CLOCK) & RCC_CLOCKTYPE_PCLK1) == RCC_CLOCKTYPE_PCLK1)       || \
                                       (((CLOCK) & RCC_CLOCKTYPE_PCLK2) == RCC_CLOCKTYPE_PCLK2)       || \
                                       (((CLOCK) & RCC_CLOCKTYPE_PCLK3) == RCC_CLOCKTYPE_PCLK3))
/**
  * @}
  */

/** @defgroup RCC_HSE_Config RCC_HSE_Config
  * @{
  */
#define RCC_HSE_OFF                    ((uint32_t)0x00000000)
#define RCC_HSE_ON                     RCC_OCENSETR_HSEON
#define RCC_HSE_BYPASS                 (RCC_OCENSETR_HSEBYP | RCC_OCENSETR_HSEON)
#define RCC_HSE_BYPASS_DIG             (RCC_OCENSETR_HSEBYP | RCC_OCENSETR_HSEON | RCC_OCENSETR_DIGBYP)

#define IS_RCC_HSE(HSE) (((HSE) == RCC_HSE_OFF) || ((HSE) == RCC_HSE_ON) || \
                          ((HSE) == RCC_HSE_BYPASS) || ((HSE) == RCC_HSE_BYPASS_DIG))
/**
  * @}
  */

/** @defgroup RCC_LSE_Config RCC_LSE_Config
  * @{
  */
#define RCC_LSE_OFF                    ((uint32_t)0x00000000)
#define RCC_LSE_ON                     RCC_BDCR_LSEON
#define RCC_LSE_BYPASS                 (RCC_BDCR_LSEBYP | RCC_BDCR_LSEON)
#define RCC_LSE_BYPASS_DIG             (RCC_BDCR_LSEBYP | RCC_BDCR_LSEON | RCC_BDCR_DIGBYP)

#define IS_RCC_LSE(LSE) (((LSE) == RCC_LSE_OFF) || ((LSE) == RCC_LSE_ON) || \
                         ((LSE) == RCC_LSE_BYPASS) || ((LSE) == RCC_LSE_BYPASS_DIG))
/**
  * @}
  */

/** @defgroup RCC_HSI_Config RCC_HSI_Config
  * @{
  */
#define RCC_HSI_OFF                    ((uint32_t)0x00000000)
#define RCC_HSI_ON                     RCC_OCENSETR_HSION

#define IS_RCC_HSI(HSI) (((HSI) == RCC_HSI_OFF) || ((HSI) == RCC_HSI_ON))
/**
  * @}
  */

