zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_hal_rcc.h
/** @defgroup RCC_RTC_Division_Factor RCC_RTC_Division_Factor
  * @{
  */
#define RCC_RTCDIV(x)                             RCC_RTCDIVR_RTCDIV_(y)

#define IS_RCC_RTC_HSEDIV(VALUE) ((1 <= (VALUE)) && ((VALUE) <= 64))
/**
  * @}
  */

/** @defgroup RCC_MPU_Clock_Divider RCC_MPU_Clock_Divider
  * @{
  */
#define RCC_MPU_DIV_OFF                RCC_MPCKDIVR_MPUDIV_0
#define RCC_MPU_DIV2                   RCC_MPCKDIVR_MPUDIV_1
#define RCC_MPU_DIV4                   RCC_MPCKDIVR_MPUDIV_2
#define RCC_MPU_DIV8                   RCC_MPCKDIVR_MPUDIV_3
#define RCC_MPU_DIV16                  RCC_MPCKDIVR_MPUDIV_4

#define IS_RCC_MPUDIV(DIVIDER) (  ((DIVIDER) == RCC_MPU_DIV2)  || \
                                  ((DIVIDER) == RCC_MPU_DIV4)  || \
                                  ((DIVIDER) == RCC_MPU_DIV8)  || \
                                  ((DIVIDER) == RCC_MPU_DIV16))
/**
  * @}
  */

/** @defgroup RCC_AXI_Clock_Divider RCC_AXI_Clock_Divider
  * @{
  */
#define RCC_AXI_DIV1                   RCC_AXIDIVR_AXIDIV_0
#define RCC_AXI_DIV2                   RCC_AXIDIVR_AXIDIV_1
#define RCC_AXI_DIV3                   RCC_AXIDIVR_AXIDIV_2
#define RCC_AXI_DIV4                   RCC_AXIDIVR_AXIDIV_3

#define IS_RCC_AXIDIV(DIVIDER) (((DIVIDER) == RCC_AXI_DIV1)   || \
                                 ((DIVIDER) == RCC_AXI_DIV2)  || \
                                 ((DIVIDER) == RCC_AXI_DIV3)  || \
                                 ((DIVIDER) == RCC_AXI_DIV4))
/**
  * @}
  */

/** @defgroup RCC_APB4_Clock_Divider RCC_APB4_Clock_Divider
  * @{
  */
#define RCC_APB4_DIV1                   RCC_APB4DIVR_APB4DIV_0
#define RCC_APB4_DIV2                   RCC_APB4DIVR_APB4DIV_1
#define RCC_APB4_DIV4                   RCC_APB4DIVR_APB4DIV_2
#define RCC_APB4_DIV8                   RCC_APB4DIVR_APB4DIV_3
#define RCC_APB4_DIV16                  RCC_APB4DIVR_APB4DIV_4

#define IS_RCC_APB4DIV(DIVIDER) (((DIVIDER) == RCC_APB4_DIV1)   || \
                                 ((DIVIDER) == RCC_APB4_DIV2)   || \
                                 ((DIVIDER) == RCC_APB4_DIV4)   || \
                                 ((DIVIDER) == RCC_APB4_DIV8)   || \
                                 ((DIVIDER) == RCC_APB4_DIV16))
/**
  * @}
  */

/** @defgroup RCC_APB5_Clock_Divider RCC_APB5_Clock_Divider
  * @{
  */
#define RCC_APB5_DIV1                   RCC_APB5DIVR_APB5DIV_0
#define RCC_APB5_DIV2                   RCC_APB5DIVR_APB5DIV_1
#define RCC_APB5_DIV4                   RCC_APB5DIVR_APB5DIV_2
#define RCC_APB5_DIV8                   RCC_APB5DIVR_APB5DIV_3
#define RCC_APB5_DIV16                  RCC_APB5DIVR_APB5DIV_4

#define IS_RCC_APB5DIV(DIVIDER) (((DIVIDER) == RCC_APB5_DIV1)   || \
                                 ((DIVIDER) == RCC_APB5_DIV2)   || \
                                 ((DIVIDER) == RCC_APB5_DIV4)   || \
                                 ((DIVIDER) == RCC_APB5_DIV8)   || \
                                 ((DIVIDER) == RCC_APB5_DIV16))
/**
  * @}
  */

/** @defgroup RCC_MCU_Clock_Divider RCC_MCU_Clock_Divider
  * @{
  */
#define RCC_MCU_DIV1                   RCC_MCUDIVR_MCUDIV_0
#define RCC_MCU_DIV2                   RCC_MCUDIVR_MCUDIV_1
#define RCC_MCU_DIV4                   RCC_MCUDIVR_MCUDIV_2
#define RCC_MCU_DIV8                   RCC_MCUDIVR_MCUDIV_3
#define RCC_MCU_DIV16                  RCC_MCUDIVR_MCUDIV_4
#define RCC_MCU_DIV32                  RCC_MCUDIVR_MCUDIV_5
#define RCC_MCU_DIV64                  RCC_MCUDIVR_MCUDIV_6
#define RCC_MCU_DIV128                 RCC_MCUDIVR_MCUDIV_7
#define RCC_MCU_DIV256                 RCC_MCUDIVR_MCUDIV_8
#define RCC_MCU_DIV512                 RCC_MCUDIVR_MCUDIV_9

#define IS_RCC_MCUDIV(DIVIDER) (((DIVIDER) == RCC_MCU_DIV1)   || \
                                 ((DIVIDER) == RCC_MCU_DIV2)   || \
                                 ((DIVIDER) == RCC_MCU_DIV4)   || \
                                 ((DIVIDER) == RCC_MCU_DIV8)   || \
                                 ((DIVIDER) == RCC_MCU_DIV16)  || \
                                 ((DIVIDER) == RCC_MCU_DIV32)  || \
                                 ((DIVIDER) == RCC_MCU_DIV64)  || \
                                 ((DIVIDER) == RCC_MCU_DIV128) || \
                                 ((DIVIDER) == RCC_MCU_DIV256) || \
                                 ((DIVIDER) == RCC_MCU_DIV512))
/**
  * @}
  */

/** @defgroup RCC_APB1_Clock_Divider RCC_APB1_Clock_Divider
  * @{
  */
#define RCC_APB1_DIV1                   RCC_APB1DIVR_APB1DIV_0
#define RCC_APB1_DIV2                   RCC_APB1DIVR_APB1DIV_1
#define RCC_APB1_DIV4                   RCC_APB1DIVR_APB1DIV_2
#define RCC_APB1_DIV8                   RCC_APB1DIVR_APB1DIV_3
#define RCC_APB1_DIV16                  RCC_APB1DIVR_APB1DIV_4

#define IS_RCC_APB1DIV(DIVIDER) (((DIVIDER) == RCC_APB1_DIV1)   || \
                                 ((DIVIDER) == RCC_APB1_DIV2)   || \
                                 ((DIVIDER) == RCC_APB1_DIV4)   || \
                                 ((DIVIDER) == RCC_APB1_DIV8)   || \
                                 ((DIVIDER) == RCC_APB1_DIV16))
/**
  * @}
  */

/** @defgroup RCC_APB2_Clock_Divider RCC_APB2_Clock_Divider
  * @{
  */
#define RCC_APB2_DIV1                   RCC_APB2DIVR_APB2DIV_0
#define RCC_APB2_DIV2                   RCC_APB2DIVR_APB2DIV_1
#define RCC_APB2_DIV4                   RCC_APB2DIVR_APB2DIV_2
#define RCC_APB2_DIV8                   RCC_APB2DIVR_APB2DIV_3
#define RCC_APB2_DIV16                  RCC_APB2DIVR_APB2DIV_4

#define IS_RCC_APB2DIV(DIVIDER) (((DIVIDER) == RCC_APB2_DIV1)   || \
                                 ((DIVIDER) == RCC_APB2_DIV2)   || \
                                 ((DIVIDER) == RCC_APB2_DIV4)   || \
                                 ((DIVIDER) == RCC_APB2_DIV8)   || \
                                 ((DIVIDER) == RCC_APB2_DIV16))
/**
  * @}
  */

/** @defgroup RCC_APB3_Clock_Divider RCC_APB3_Clock_Divider
  * @{
  */
#define RCC_APB3_DIV1                   RCC_APB3DIVR_APB3DIV_0
#define RCC_APB3_DIV2                   RCC_APB3DIVR_APB3DIV_1
#define RCC_APB3_DIV4                   RCC_APB3DIVR_APB3DIV_2
#define RCC_APB3_DIV8                   RCC_APB3DIVR_APB3DIV_3
#define RCC_APB3_DIV16                  RCC_APB3DIVR_APB3DIV_4

