zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_hal_rcc.h
#define IS_RCC_APB3DIV(DIVIDER) (((DIVIDER) == RCC_APB3_DIV1)   || \
                                 ((DIVIDER) == RCC_APB3_DIV2)   || \
                                 ((DIVIDER) == RCC_APB3_DIV4)   || \
                                 ((DIVIDER) == RCC_APB3_DIV8)   || \
                                 ((DIVIDER) == RCC_APB3_DIV16))
/**
  * @}
  */

/** @defgroup RCC_PLL_Config RCC_PLL_Config
  * @{
  */
#define RCC_PLL_NONE                   ((uint32_t)0x00000000)
#define RCC_PLL_OFF                    ((uint32_t)0x00000001)
#define RCC_PLL_ON                     ((uint32_t)0x00000002)

#define IS_RCC_PLL(PLL) (((PLL) == RCC_PLL_NONE) ||((PLL) == RCC_PLL_OFF) || \
                         ((PLL) == RCC_PLL_ON))
/**
  * @}
  */

/** @defgroup RCC_PLL_Mode RCC_PLL_Mode
  * @{
  */
#define RCC_PLL_INTEGER                ((uint32_t)0x00000000)
#define RCC_PLL_FRACTIONAL              ((uint32_t)0x00000001)
#define RCC_PLL_SPREAD_SPECTRUM         ((uint32_t)0x00000002)

#define IS_RCC_PLLMODE(MODE) (((MODE) == RCC_PLL_FRACTIONAL) || \
                                     ((MODE) == RCC_PLL_INTEGER) || \
                                     ((MODE) == RCC_PLL_SPREAD_SPECTRUM))
/**
  * @}
  */


/** @defgroup RCC_SSCG_MODE RCC_SSCG_MODE
  * @{
  */
#define RCC_SSCG_CENTER_SPREAD          ((uint32_t)0x00000000)
#define RCC_SSCG_DOWN_SPREAD            ((uint32_t)RCC_PLL1CSGR_SSCG_MODE)

#define IS_RCC_SSCG_MODE(MODE) (((MODE) == RCC_SSCG_CENTER_SPREAD) || \
                                ((MODE) == RCC_SSCG_DOWN_SPREAD))
/**
  * @}
  */

/** @defgroup RCC_MOD_PER RCC_MOD_PER
  * @{
  */
#define RCC_MOD_PER_MIN          ((uint32_t)0x00000001)
#define RCC_MOD_PER_MAX           ((uint32_t)RCC_PLL1CSGR_MOD_PER) /* 8191 */

#define IS_RCC_MOD_PER(ADJ) ((RCC_MOD_PER_MIN <= (ADJ)) && \
                            ((ADJ) <= RCC_MOD_PER_MAX))
/**
  * @}
  */

/** @defgroup RCC_INC_STEP RCC_INC_STEP
  * @{
  */
#define RCC_INC_STEP_MIN          ((uint32_t)0x00000001)
#define RCC_INC_STEP_MAX           ((uint32_t)0x7FFF) /* 32767 */

#define IS_RCC_INC_STEP(ADJ) ((RCC_INC_STEP_MIN <= (ADJ)) && \
                            ((ADJ) <= RCC_INC_STEP_MAX))
/**
  * @}
  */

/** @defgroup RCC_RPDFN_DIS RCC_RPDFN_DIS
  * @{
  */
#define RCC_RPDFN_DIS_ENABLED          ((uint32_t)0x00000000)
#define RCC_RPDFN_DIS_DISABLED         ((uint32_t)RCC_PLL1CSGR_RPDFN_DIS)

#define IS_RCC_RPDFN_DIS(STATE) (((STATE) == RCC_RPDFN_DIS_DISABLED) || \
                             ((STATE) == RCC_RPDFN_DIS_ENABLED))
/**
  * @}
  */


/** @defgroup RCC_TPDFN_DIS RCC_TPDFN_DIS
  * @{
  */
#define RCC_TPDFN_DIS_ENABLED            ((uint32_t)0x00000000)
#define RCC_TPDFN_DIS_DISABLED           ((uint32_t)RCC_PLL1CSGR_TPDFN_DIS)

#define IS_RCC_TPDFN_DIS(STATE) (((STATE) == RCC_TPDFN_DIS_DISABLED) || \
                            ((STATE) == RCC_TPDFN_DIS_ENABLED))
/**
  * @}
  */


/** @defgroup RCC_PLL12_Clock_Source RCC_PLL12_Clock_Source
  * @{
  */
#define RCC_PLL12SOURCE_HSI              RCC_RCK12SELR_PLL12SRC_0
#define RCC_PLL12SOURCE_HSE              RCC_RCK12SELR_PLL12SRC_1
#define RCC_PLL12SOURCE_OFF              RCC_RCK12SELR_PLL12SRC_2

#define IS_RCC_PLL12SOURCE(SOURCE) (((SOURCE) == RCC_PLL12SOURCE_HSI) || \
                                      ((SOURCE) == RCC_PLL12SOURCE_HSE) || \
                                      ((SOURCE) == RCC_PLL12SOURCE_OFF))
/**
 * @}
 */


/** @defgroup RCC_PLL3_Clock_Source RCC_PLL3_Clock_Source
  * @{
  */
#define RCC_PLL3SOURCE_HSI              RCC_RCK3SELR_PLL3SRC_0
#define RCC_PLL3SOURCE_HSE              RCC_RCK3SELR_PLL3SRC_1
#define RCC_PLL3SOURCE_CSI              RCC_RCK3SELR_PLL3SRC_2
#define RCC_PLL3SOURCE_OFF              RCC_RCK3SELR_PLL3SRC_3


#define IS_RCC_PLL3SOURCE(SOURCE) (((SOURCE) == RCC_PLL3SOURCE_HSI)  || \
                                    ((SOURCE) == RCC_PLL3SOURCE_HSE)  || \
                                    ((SOURCE) == RCC_PLL3SOURCE_CSI)  || \
                                    ((SOURCE) == RCC_PLL3SOURCE_OFF))

/**
  * @}
  */


/** @defgroup RCC_PLL4_Clock_Source RCC_PLL4_Clock_Source
  * @{
  */
#define RCC_PLL4SOURCE_HSI              RCC_RCK4SELR_PLL4SRC_0
#define RCC_PLL4SOURCE_HSE              RCC_RCK4SELR_PLL4SRC_1
#define RCC_PLL4SOURCE_CSI              RCC_RCK4SELR_PLL4SRC_2
#define RCC_PLL4SOURCE_I2S_CKIN         RCC_RCK4SELR_PLL4SRC_3


#define IS_RCC_PLL4SOURCE(SOURCE) (((SOURCE) == RCC_PLL4SOURCE_HSI)  || \
                                    ((SOURCE) == RCC_PLL4SOURCE_HSE)  || \
                                    ((SOURCE) == RCC_PLL4SOURCE_CSI)  || \
                                    ((SOURCE) == RCC_PLL4SOURCE_I2S_CKIN))
/**
  * @}
  */

/** @defgroup RCC_PLL1_MUL_DIV_Factors RCC_PLL1_MUL_DIV_Factors
  * @{
  */
#define IS_RCC_PLLM1_VALUE(VALUE) ((1 <= (VALUE)) && ((VALUE) <= 64))
/* @note DIVN limits are different depending if using integer or fractional mode */
#define IS_RCC_PLLN1_INT_VALUE(VALUE)  ((25 <= (VALUE)) && ((VALUE) <= 100))
#define IS_RCC_PLLN1_FRAC_VALUE(VALUE) ((4 <= (VALUE)) && ((VALUE) <= 512))
#define IS_RCC_PLLP1_VALUE(VALUE) ((1 <= (VALUE)) && ((VALUE) <= 128))
#define IS_RCC_PLLQ1_VALUE(VALUE) ((1 <= (VALUE)) && ((VALUE) <= 128))
#define IS_RCC_PLLR1_VALUE(VALUE) ((1 <= (VALUE)) && ((VALUE) <= 128))
/**
  * @}
  */

/** @defgroup RCC_PLL2_MUL_DIV_Factors RCC_PLL2_MUL_DIV_Factors
  * @{
  */
#define IS_RCC_PLLM2_VALUE(VALUE) ((1 <= (VALUE)) && ((VALUE) <= 64))
/* @note DIVN limits are different depending if using integer or fractional mode */
#define IS_RCC_PLLN2_INT_VALUE(VALUE)  ((25 <= (VALUE)) && ((VALUE) <= 100))
#define IS_RCC_PLLN2_FRAC_VALUE(VALUE) ((4 <= (VALUE)) && ((VALUE) <= 512))
#define IS_RCC_PLLP2_VALUE(VALUE) ((1 <= (VALUE)) && ((VALUE) <= 128))
#define IS_RCC_PLLQ2_VALUE(VALUE) ((1 <= (VALUE)) && ((VALUE) <= 128))
#define IS_RCC_PLLR2_VALUE(VALUE) ((1 <= (VALUE)) && ((VALUE) <= 128))
/**
  * @}
  */

/** @defgroup RCC_PLL3_MUL_DIV_Factors RCC_PLL3_MUL_DIV_Factors
  * @{
  */
#define IS_RCC_PLLM3_VALUE(VALUE) ((1 <= (VALUE)) && ((VALUE) <= 64))
/* @note DIVN limits are different depending if using integer or fractional mode */
#define IS_RCC_PLLN3_INT_VALUE(VALUE)  ((25 <= (VALUE)) && ((VALUE) <= 200))
#define IS_RCC_PLLN3_FRAC_VALUE(VALUE) ((4 <= (VALUE)) && ((VALUE) <= 512))
#define IS_RCC_PLLP3_VALUE(VALUE) ((1 <= (VALUE)) && ((VALUE) <= 128))
#define IS_RCC_PLLQ3_VALUE(VALUE) ((1 <= (VALUE)) && ((VALUE) <= 128))
#define IS_RCC_PLLR3_VALUE(VALUE) ((1 <= (VALUE)) && ((VALUE) <= 128))
/**
  * @}
  */

/** @defgroup RCC_PLL4_MUL_DIV_Factors RCC_PLL4_MUL_DIV_Factors
  * @{
  */
#define IS_RCC_PLLM4_VALUE(VALUE) ((1 <= (VALUE)) && ((VALUE) <= 64))
/* @note DIVN limits are different depending if using integer or fractional mode */
#define IS_RCC_PLLN4_INT_VALUE(VALUE)  ((25 <= (VALUE)) && ((VALUE) <= 200))
#define IS_RCC_PLLN4_FRAC_VALUE(VALUE) ((4 <= (VALUE)) && ((VALUE) <= 512))
#define IS_RCC_PLLP4_VALUE(VALUE) ((1 <= (VALUE)) && ((VALUE) <= 128))
#define IS_RCC_PLLQ4_VALUE(VALUE) ((1 <= (VALUE)) && ((VALUE) <= 128))
#define IS_RCC_PLLR4_VALUE(VALUE) ((1 <= (VALUE)) && ((VALUE) <= 128))
/**
  * @}
  */

