zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_hal_rcc.h
/** @defgroup RCC_PLL1_Clock_Output RCC_PLL1_Clock_Output
  * @{
  */
#define RCC_PLL1_DIVP                RCC_PLL1CR_DIVPEN
#define RCC_PLL1_DIVQ                RCC_PLL1CR_DIVQEN
#define RCC_PLL1_DIVR                RCC_PLL1CR_DIVREN

#define IS_RCC_PLL1CLOCKOUT_VALUE(VALUE) (((VALUE) == RCC_PLL1_DIVP) || \
                                         ((VALUE) == RCC_PLL1_DIVQ) || \
                                         ((VALUE) == RCC_PLL1_DIVR))
/**
  * @}
  */


/** @defgroup RCC_PLL2_Clock_Output RCC_PLL2_Clock_Output
  * @{
  */
#define RCC_PLL2_DIVP                RCC_PLL2CR_DIVPEN
#define RCC_PLL2_DIVQ                RCC_PLL2CR_DIVQEN
#define RCC_PLL2_DIVR                RCC_PLL2CR_DIVREN

#define IS_RCC_PLL2CLOCKOUT_VALUE(VALUE) (((VALUE) == RCC_PLL2CR_DIVPEN) || \
                                         ((VALUE) == RCC_PLL2CR_DIVQEN) || \
                                         ((VALUE) == RCC_PLL2CR_DIVREN))
/**
  * @}
  */

/** @defgroup RCC_PLL3_Clock_Output RCC_PLL3_Clock_Output
  * @{
  */

#define RCC_PLL3_DIVP                RCC_PLL3CR_DIVPEN
#define RCC_PLL3_DIVQ                RCC_PLL3CR_DIVQEN
#define RCC_PLL3_DIVR                RCC_PLL3CR_DIVREN

#define IS_RCC_PLL3CLOCKOUT_VALUE(VALUE) (((VALUE) == RCC_PLL3_DIVP) || \
                                         ((VALUE) == RCC_PLL3_DIVQ) || \
                                         ((VALUE) == RCC_PLL3_DIVR))
/**
  * @}
  */

/** @defgroup RCC_PLL4_Clock_Output RCC_PLL4_Clock_Output
  * @{
  */
#define RCC_PLL4_DIVP                RCC_PLL4CR_DIVPEN
#define RCC_PLL4_DIVQ                RCC_PLL4CR_DIVQEN
#define RCC_PLL4_DIVR                RCC_PLL4CR_DIVREN

#define IS_RCC_PLL4CLOCKOUT_VALUE(VALUE) (((VALUE) == RCC_PLL4_DIVP) || \
                                         ((VALUE) == RCC_PLL4_DIVQ) || \
                                         ((VALUE) == RCC_PLL4_DIVR))


/**
  * @}
  */

/** @defgroup RCC_PLL3_IF_Range RCC_PLL3_IF_Range
  * @{
  */
#define RCC_PLL3IFRANGE_0              RCC_PLL3CFGR1_IFRGE_0
#define RCC_PLL3IFRANGE_1              RCC_PLL3CFGR1_IFRGE_1
/**
  * @}
  */

/** @defgroup RCC_PLL4_IF_Range RCC_PLL4_IF_Range
  * @{
  */
#define RCC_PLL4IFRANGE_0              RCC_PLL4CFGR1_IFRGE_0
#define RCC_PLL4IFRANGE_1              RCC_PLL4CFGR1_IFRGE_1
/**
  * @}
  */


/** @defgroup RCC_RTC_Clock_Source RCC_RTC_Clock_Source
  * @{
  */
#define RCC_RTCCLKSOURCE_OFF           RCC_BDCR_RTCSRC_0 /* No clock (default after backup domain reset)*/
#define RCC_RTCCLKSOURCE_LSE           RCC_BDCR_RTCSRC_1
#define RCC_RTCCLKSOURCE_LSI           RCC_BDCR_RTCSRC_2
#define RCC_RTCCLKSOURCE_HSE_DIV       RCC_BDCR_RTCSRC_3 /* HSE clock divided by RTCDIV value is used as RTC clock*/

#define IS_RCC_RTCCLKSOURCE(SOURCE) (((SOURCE) == RCC_RTCCLKSOURCE_OFF) || ((SOURCE) == RCC_RTCCLKSOURCE_LSE) || \
                                      ((SOURCE) == RCC_RTCCLKSOURCE_LSI) || ((SOURCE) == RCC_RTCCLKSOURCE_HSE_DIV))
/**
  * @}
  */

/** @defgroup RCC_Flag RCC_Flag
  * @{
  */
/* Flags in the OCRDYR register */
#define RCC_FLAG_HSIRDY           ( (RCC->OCRDYR & RCC_OCRDYR_HSIRDY)     == RCC_OCRDYR_HSIRDY )
#define RCC_FLAG_HSIDIVRDY        ( (RCC->OCRDYR & RCC_OCRDYR_HSIDIVRDY)  == RCC_OCRDYR_HSIDIVRDY )
#define RCC_FLAG_CSIRDY           ( (RCC->OCRDYR & RCC_OCRDYR_CSIRDY)     == RCC_OCRDYR_CSIRDY )
#define RCC_FLAG_HSERDY           ( (RCC->OCRDYR & RCC_OCRDYR_HSERDY)     == RCC_OCRDYR_HSERDY )
#define RCC_FLAG_AXICKRDY         ( (RCC->OCRDYR & RCC_OCRDYR_AXICKRDY)   == RCC_OCRDYR_AXICKRDY )
#define RCC_FLAG_CKREST           ( (RCC->OCRDYR & RCC_OCRDYR_CKREST)     == RCC_OCRDYR_CKREST )

/* Flags in the MPCKSELR register */
#define RCC_FLAG_MPUSRCRDY        ( (RCC->MPCKSELR & RCC_MPCKSELR_MPUSRCRDY)     == RCC_MPCKSELR_MPUSRCRDY )

/* Flags in the ASSCKSELR register */
#define RCC_FLAG_AXISSRCRDY       ( (RCC->ASSCKSELR & RCC_ASSCKSELR_AXISSRCRDY)  == RCC_ASSCKSELR_AXISSRCRDY )

/* Flags in the MSSCKSELR register */
#define RCC_FLAG_MCUSSRCRDY       ( (RCC->MSSCKSELR & RCC_MSSCKSELR_MCUSSRCRDY)  == RCC_MSSCKSELR_MCUSSRCRDY )

/* Flags in the RCK12SELR register */
#define RCC_FLAG_PLL12SRCRDY      ( (RCC->RCK12SELR & RCC_RCK12SELR_PLL12SRCRDY) == RCC_RCK12SELR_PLL12SRCRDY )

/* Flags in the RCK3SELR */
#define RCC_FLAG_PLL3SRCRDY       ( (RCC->RCK3SELR & RCC_RCK3SELR_PLL3SRCRDY)    == RCC_RCK3SELR_PLL3SRCRDY )

/* Flags in the RCK4SELR register */
#define RCC_FLAG_PLL4SRCRDY       ( (RCC->RCK4SELR & RCC_RCK4SELR_PLL4SRCRDY)    == RCC_RCK4SELR_PLL4SRCRDY )

/* Flags in the TIMG1PRER register */
#define RCC_FLAG_TIMG1PRERDY      ( (RCC->TIMG1PRER & RCC_TIMG1PRER_TIMG1PRERDY) == RCC_TIMG1PRER_TIMG1PRERDY )

/* Flags in the TIMG2PRER register */
#define RCC_FLAG_TIMG2PRERDY      ( (RCC->TIMG2PRER & RCC_TIMG2PRER_TIMG2PRERDY) == RCC_TIMG2PRER_TIMG2PRERDY )

/* Flags in the MPCKDIVR register */
#define RCC_FLAG_MPUDIVRDY        ( (RCC->MPCKDIVR & RCC_MPCKDIVR_MPUDIVRDY)     == RCC_MPCKDIVR_MPUDIVRDY )

/* Flags in the AXIDIVR register */
#define RCC_FLAG_AXIDIVRDY        ( (RCC->AXIDIVR & RCC_AXIDIVR_AXIDIVRDY)       == RCC_AXIDIVR_AXIDIVRDY )

/* Flags in the APB4DIVR register */
#define RCC_FLAG_APB4DIVRDY       ( (RCC->APB4DIVR & RCC_APB4DIVR_APB4DIVRDY)    == RCC_APB4DIVR_APB4DIVRDY )

/* Flags in the APB5DIVR register */
#define RCC_FLAG_APB5DIVRDY       ( (RCC->APB5DIVR & RCC_APB5DIVR_APB5DIVRDY)    == RCC_APB5DIVR_APB5DIVRDY )

/* Flags in the MCUDIVR register */
#define RCC_FLAG_MCUDIVRDY        ( (RCC->MCUDIVR & RCC_MCUDIVR_MCUDIVRDY)       ==  RCC_MCUDIVR_MCUDIVRDY )

/* Flags in the APB1DIVR register */
#define RCC_FLAG_APB1DIVRDY       ((RCC->APB1DIVR & RCC_APB1DIVR_APB1DIVRDY)     ==  RCC_APB1DIVR_APB1DIVRDY )

/* Flags in the APB2DIVR register */
#define RCC_FLAG_APB2DIVRDY       ((RCC->APB2DIVR & RCC_APB2DIVR_APB2DIVRDY)     ==  RCC_APB2DIVR_APB2DIVRDY )

/* Flags in the APB3DIVR register */
#define RCC_FLAG_APB3DIVRDY       ((RCC->APB3DIVR & RCC_APB3DIVR_APB3DIVRDY)     ==  RCC_APB3DIVR_APB3DIVRDY )

/* Flags in the PLL1CR register */
#define RCC_FLAG_PLL1RDY          ((RCC->PLL1CR & RCC_PLL1CR_PLL1RDY)            ==  RCC_PLL1CR_PLL1RDY )

/* Flags in the PLL2CR register */
#define RCC_FLAG_PLL2RDY          ((RCC->PLL2CR & RCC_PLL2CR_PLL2RDY)            ==  RCC_PLL2CR_PLL2RDY )

/* Flags in the PLL3CR register */
#define RCC_FLAG_PLL3RDY          ((RCC->PLL3CR & RCC_PLL3CR_PLL3RDY)            ==  RCC_PLL3CR_PLL3RDY )

/* Flags in the PLL4CR register */
#define RCC_FLAG_PLL4RDY          ((RCC->PLL4CR & RCC_PLL4CR_PLL4RDY)            ==  RCC_PLL4CR_PLL4RDY )

/* Flags in the DDRCKSELR register */
#define RCC_FLAG_DDRPHYCSRCRDY    ((RCC->DDRCKSELR & RCC_DDRCKSELR_DDRPHYCSRCRDY) == RCC_DDRCKSELR_DDRPHYCSRCRDY )

/* Flags in the BDCR register */
#define RCC_FLAG_LSERDY          ((RCC->BDCR & RCC_BDCR_LSERDY)                 ==  RCC_BDCR_LSERDY )

/* Flags in the RDLSICR register */
#define RCC_FLAG_LSIRDY           ((RCC->RDLSICR & RCC_RDLSICR_LSIRDY)           ==  RCC_RDLSICR_LSIRDY )

#if defined(CORE_CA7)
/* Flags in the RCC_MP_RSTSCLRR */
#define RCC_MASK_ALL_RESET_FLAGS  (0x00001BDFU)
#define RCC_FLAG_PORRST           ((RCC->MP_RSTSCLRR & RCC_MP_RSTSCLRR_PORRSTF)  == RCC_MP_RSTSCLRR_PORRSTF)
#define RCC_FLAG_BORRST           ((RCC->MP_RSTSCLRR & RCC_MP_RSTSCLRR_BORRSTF)  == RCC_MP_RSTSCLRR_BORRSTF)
#define RCC_FLAG_PADRST           ((RCC->MP_RSTSCLRR & RCC_MP_RSTSCLRR_PADRSTF)  == RCC_MP_RSTSCLRR_PADRSTF)
#define RCC_FLAG_HCSSRST          ((RCC->MP_RSTSCLRR & RCC_MP_RSTSCLRR_HCSSRSTF) == RCC_MP_RSTSCLRR_HCSSRSTF)
#define RCC_FLAG_VCORERST         ((RCC->MP_RSTSCLRR & RCC_MP_RSTSCLRR_VCORERSTF)  == RCC_MP_RSTSCLRR_VCORERSTF)
#define RCC_FLAG_MPSYSRSTF        ((RCC->MP_RSTSCLRR & RCC_MP_RSTSCLRR_MPSYSRSTF)  == RCC_MP_RSTSCLRR_MPSYSRSTF)
#define RCC_FLAG_MCSYSRSTF        ((RCC->MP_RSTSCLRR & RCC_MP_RSTSCLRR_MCSYSRSTF)  == RCC_MP_RSTSCLRR_MCSYSRSTF)
#define RCC_FLAG_IWDG1RST         ((RCC->MP_RSTSCLRR & RCC_MP_RSTSCLRR_IWDG1RSTF)  == RCC_MP_RSTSCLRR_IWDG1RSTF)
#define RCC_FLAG_IWDG2RST         ((RCC->MP_RSTSCLRR & RCC_MP_RSTSCLRR_IWDG2RSTF)  == RCC_MP_RSTSCLRR_IWDG2RSTF)
#define RCC_FLAG_STDBYRSTF        ((RCC->MP_RSTSCLRR & RCC_MP_RSTSCLRR_STDBYRSTF)  == RCC_MP_RSTSCLRR_STDBYRSTF)
#define RCC_FLAG_CSTDBYRSTF       ((RCC->MP_RSTSCLRR & RCC_MP_RSTSCLRR_CSTDBYRSTF) == RCC_MP_RSTSCLRR_CSTDBYRSTF)
#define RCC_FLAG_MPUP0RSTF        ((RCC->MP_RSTSCLRR & RCC_MP_RSTSCLRR_MPUP0RSTF)  == RCC_MP_RSTSCLRR_MPUP0RSTF)
#define RCC_FLAG_MPUP1RSTF        ((RCC->MP_RSTSCLRR & RCC_MP_RSTSCLRR_MPUP1RSTF)  == RCC_MP_RSTSCLRR_MPUP1RSTF)
#elif defined(CORE_CM4)
/* Flags in the RCC_MC_RSTSCLRR */
#define RCC_MASK_ALL_RESET_FLAGS  (0x000007FFU)
#define RCC_FLAG_PORRST           ((RCC->MC_RSTSCLRR & RCC_MC_RSTSCLRR_PORRSTF)  == RCC_MC_RSTSCLRR_PORRSTF)
#define RCC_FLAG_BORRST           ((RCC->MC_RSTSCLRR & RCC_MC_RSTSCLRR_BORRSTF)  == RCC_MC_RSTSCLRR_BORRSTF)
#define RCC_FLAG_PADRST           ((RCC->MC_RSTSCLRR & RCC_MC_RSTSCLRR_PADRSTF)  == RCC_MC_RSTSCLRR_PADRSTF)
#define RCC_FLAG_HCSSRST          ((RCC->MC_RSTSCLRR & RCC_MC_RSTSCLRR_HCSSRSTF)  == RCC_MC_RSTSCLRR_HCSSRSTF)
#define RCC_FLAG_VCORERST         ((RCC->MC_RSTSCLRR & RCC_MC_RSTSCLRR_VCORERSTF)  == RCC_MC_RSTSCLRR_VCORERSTF)
#define RCC_FLAG_MCURST           ((RCC->MC_RSTSCLRR & RCC_MC_RSTSCLRR_MCURSTF)  == RCC_MC_RSTSCLRR_MCURSTF)
#define RCC_FLAG_MPSYSRST         ((RCC->MC_RSTSCLRR & RCC_MC_RSTSCLRR_MPSYSRSTF)  == RCC_MC_RSTSCLRR_MPSYSRSTF)
#define RCC_FLAG_MCSYSRST         ((RCC->MC_RSTSCLRR & RCC_MC_RSTSCLRR_MCSYSRSTF)  == RCC_MC_RSTSCLRR_MCSYSRSTF)
#define RCC_FLAG_IWDG1RST         ((RCC->MC_RSTSCLRR & RCC_MC_RSTSCLRR_IWDG1RSTF)  == RCC_MC_RSTSCLRR_IWDG1RSTF)
#define RCC_FLAG_IWDG2RST         ((RCC->MC_RSTSCLRR & RCC_MC_RSTSCLRR_IWDG2RSTF)  == RCC_MC_RSTSCLRR_IWDG2RSTF)
#define RCC_FLAG_WWDG1RST         ((RCC->MC_RSTSCLRR & RCC_MC_RSTSCLRR_WWDG1RSTF)  == RCC_MC_RSTSCLRR_WWDG1RSTF)
#endif

/** @brief  Clear all the reset flags
  * @note   Writing a '1' clears the corresponding bit to '0'
  */
#if defined(CORE_CA7)
#define __HAL_RCC_CLEAR_RESET_FLAGS() WRITE_REG(RCC->MP_RSTSCLRR, RCC_MASK_ALL_RESET_FLAGS)
#elif defined(CORE_CM4)
#define __HAL_RCC_CLEAR_RESET_FLAGS() WRITE_REG(RCC->MC_RSTSCLRR, RCC_MASK_ALL_RESET_FLAGS)
#endif /* CORE_CA7 */

#if defined(CORE_CA7)
/** @brief  Check RCC flag is set or not.
  * @param  __FLAG__: specifies the flag to check.
  *         This parameter can be one of the following values:
  *         @arg RCC_FLAG_PORRST
  *         @arg RCC_FLAG_BORRST
  *         @arg RCC_FLAG_PADRST
  *         @arg RCC_FLAG_HCSSRST
  *         @arg RCC_FLAG_VCORERST
  *         @arg RCC_FLAG_MPSYSRSTF
  *         @arg RCC_FLAG_MCSYSRSTF
  *         @arg RCC_FLAG_IWDG1RST
  *         @arg RCC_FLAG_IWDG2RST
  *         @arg RCC_FLAG_STDBYRSTF
  *         @arg RCC_FLAG_CSTDBYRSTF
  *         @arg RCC_FLAG_MPUP0RSTF
  *         @arg RCC_FLAG_MPUP1RSTF
  * @retval The state of __FLAG__ (TRUE or FALSE).
  */
#elif defined(CORE_CM4)
/** @brief  Check RCC flag is set or not.
  * @param  __FLAG__: specifies the flag to check.
  *         This parameter can be one of the following values:
  *         @arg RCC_FLAG_PORRST
  *         @arg RCC_FLAG_BORRST
  *         @arg RCC_FLAG_PADRST
  *         @arg RCC_FLAG_HCSSRST
  *         @arg RCC_FLAG_VCORERST
  *         @arg RCC_FLAG_MCURST
  *         @arg RCC_FLAG_MPSYSRST
  *         @arg RCC_FLAG_MCSYSRST
  *         @arg RCC_FLAG_IWDG1RST
  *         @arg RCC_FLAG_IWDG2RST
  *         @arg RCC_FLAG_WWDG1RST
  * @retval The state of __FLAG__ (TRUE or FALSE).
  */
#endif /* CORE_CA7 */
#define __HAL_RCC_GET_FLAG(__FLAG__) ( __FLAG__ ? 1:0 )
/**
  * @}
  */

/** @defgroup RCC_Calibration RCC_Calibration limits
  * @{
  */
/** RCC_Calibration limits*/
#define IS_RCC_HSICALIBRATION_VALUE(VALUE) ((VALUE) <= 0x7F)
#define IS_RCC_CSICALIBRATION_VALUE(VALUE) ((VALUE) <= 0x1F)
/**
  * @}
  */

