zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_hal_rcc.h
/** @brief  Macro to get the LSE driving capability.
  * @retval The LSE Driving capability . The returned value can be one
  *         of the following:
  *             - RCC_LSEDRIVE_LOW: LSE oscillator low drive capability (default after backup domain reset)
  *             - RCC_LSEDRIVE_MEDIUMLOW: LSE oscillator medium low drive capability.
  *             - RCC_LSEDRIVE_MEDIUMHIGH: LSE oscillator medium high drive capability.
  *             - RCC_LSEDRIVE_HIGH: LSE oscillator high drive capability.
  */
#define  __HAL_RCC_GET_LSEDRIVE() ((uint32_t)(READ_BIT(RCC->BDCR, RCC_BDCR_LSEDRV)))

/** @brief  Macros to enable or disable the the RTC clock.
  * @note   These macros must be used only after the RTC clock source was selected.
  */
#define __HAL_RCC_RTC_ENABLE()         SET_BIT(RCC->BDCR, RCC_BDCR_RTCCKEN)
#define __HAL_RCC_RTC_DISABLE()        CLEAR_BIT(RCC->BDCR, RCC_BDCR_RTCCKEN)

/** @brief  Macros to configure the RTC clock (RTCCLK).
  * @note   As the RTC clock configuration bits are in the Backup domain and write
  *         access is protected to this domain after reset, you have to enable write
  *         access using the Power Backup Access macro ( DBP bit in the PWR control
  *         register 1 PWR_CR1 has to be set to 1) before to configure
  *         the RTC clock source (to be done once after reset).
  * @note   Once the RTC clock is configured it can't be changed unless the
  *         Backup domain is reset using __HAL_RCC_BACKUPRESET_RELEASE() macro, or by
  *         a Power On Reset (POR).
  * @param  __RTCCLKSource__: specifies the RTC clock source.
  *         This parameter can be one of the following values:
  *            @arg RCC_RTCCLKSOURCE_OFF: No clock (default after backup domain reset)
  *            @arg RCC_RTCCLKSOURCE_LSE: LSE selected as RTC clock.
  *            @arg RCC_RTCCLKSOURCE_LSI: LSI selected as RTC clock.
  *            @arg RCC_RTCCLKSOURCE_HSE_DIV: HSE clock divided by RTCDIV value is used as RTC clock
  *
  * @note   If the LSE or LSI is used as RTC clock source, the RTC continues to
  *         work in STOP and STANDBY modes, and can be used as wakeup source.
  *         However, when the HSE clock is used as RTC clock source, the RTC
  *         cannot be used in STOP and STANDBY modes.
  * @note   The maximum input clock frequency for RTC is 1MHz (when using HSE as
  *         RTC clock source).
  */
#define __HAL_RCC_RTC_CONFIG(__RTCCLKSource__)  \
                 MODIFY_REG( RCC->BDCR, RCC_BDCR_RTCSRC, (__RTCCLKSource__))


/** @brief  Macro to get the clock source used as RTC clock.
  * @retval The clock source used as RTC clock. The returned value can be one
  *         of the following:
  *             - RCC_RTCCLKSOURCE_OFF:  No clock (default after backup domain reset)
  *             - RCC_RTCCLKSOURCE_LSE:  LSE used as RTC clock.
  *             - RCC_RTCCLKSOURCE_LSI:  LSI used as RTC clock.
  *             - RCC_RTCCLKSOURCE_HSE_DIV: HSE clock divided by RTCDIV value is used as RTC clock
  */
#define  __HAL_RCC_GET_RTC_SOURCE() ((uint32_t)(READ_BIT(RCC->BDCR, RCC_BDCR_RTCSRC)))


/** @brief  Macros to force or release the Backup domain reset.
  * @note   This function resets the RTC peripheral (including the backup registers)
  *
  * @note   The BKPSRAM and RETRAM are not affected
  */
#define __HAL_RCC_BACKUPRESET_FORCE()   SET_BIT(RCC->BDCR, RCC_BDCR_VSWRST)
#define __HAL_RCC_BACKUPRESET_RELEASE() CLEAR_BIT(RCC->BDCR, RCC_BDCR_VSWRST)


/** @brief  Macros to enable or disable the PLL1.
  * @note   After enabling the main PLL, the application software should wait on
  *         PLLRDY flag to be set indicating that PLL clock is stable and can
  *         be used as system clock source.
  * @note   The PLL1 can not be disabled if it is used as MPU clock source
  * @note   The PLL1 is disabled by hardware when entering STOP and STANDBY modes.
  */

#define __HAL_RCC_PLL1_ENABLE()     SET_BIT(RCC->PLL1CR, RCC_PLL1CR_PLLON )
#define __HAL_RCC_PLL1_DISABLE()    CLEAR_BIT(RCC->PLL1CR, RCC_PLL1CR_PLLON)

/**
  * @brief  Enables or disables each clock output
  * @note   Enabling/disabling  Those Clocks outputs can be disabled anytime  without the need to stop the PLL,
  *         with the exception of ck_pll_p  cannot be stopped if used as MPU Clock
  * @param  __RCC_PLL1ClockOut__: specifies the PLL clock to be outputed
  *          This parameter can be one of the following values:
  *            @arg RCC_PLL1_DIVP
  *            @arg RCC_PLL1_DIVQ
  *            @arg RCC_PLL1_DIVR
  * @retval None
  */

#define __HAL_RCC_PLL1CLKOUT_ENABLE(__RCC_PLL1ClockOut__)       SET_BIT(RCC->PLL1CR, __RCC_PLL1ClockOut__ )

#define __HAL_RCC_PLL1CLKOUT_DISABLE(__RCC_PLL1ClockOut__)      CLEAR_BIT(RCC->PLL1CR, __RCC_PLL1ClockOut__ )


/**
  * @brief  Enables or disables Fractional Part Of The Multiplication Factor of PLL1 VCO
  * @note   Enabling/disabling  Fractional Part can be done anytime  without the need to stop the PLL1
  * @retval None
  */

#define __HAL_RCC_PLL1FRACV_ENABLE()        SET_BIT(RCC->PLL1FRACR, RCC_PLL1FRACR_FRACLE)

#define __HAL_RCC_PLL1FRACV_DISABLE()       CLEAR_BIT(RCC->PLL1FRACR, RCC_PLL1FRACR_FRACLE)



/**
  * @brief  Macro to configure PLL1 and PLL2 clock source
  * @note   This function must be used only when the PLLs are disabled.
  *
  * @param  __RCC_PLL12SOURCE__: specifies the PLL1 and PLL2 entry clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_PLL12SOURCE_HSI: HSI oscillator clock selected as PLL1 and PLL2 clock entry
  *            @arg RCC_PLL12SOURCE_HSE: HSE oscillator clock selected as PLL1 and PLL2 clock entry
  *            @arg RCC_PLL12SOURCE_OFF: No clock send to DIVMx divider and PLLs
  * @note   This clock source (__RCC_PLL12Source__) is common for the PLL1 and PLL2 .
  * @retval None
  */
#define __HAL_RCC_PLL12_SOURCE(__RCC_PLL12SOURCE__ ) \
                  do{ MODIFY_REG( RCC->RCK12SELR, RCC_RCK12SELR_PLL12SRC, __RCC_PLL12SOURCE__ );  \
                  } while(0)

/** @brief  Macro to get the clock source used as PLL1 and PLL2 clocks.
  * @retval The clock source used as PLL1 and PLL1 clocks. The returned value can be one
  *         of the following:
  *              - RCC_PLL12SOURCE_HSI: HSI used as PLL12 clock.
  *              - RCC_PLL12SOURCE_HSE: HSE used as PLL12 clock.
  *              - RCC_PLL12SOURCE_OFF: PLL1 and PLL2 clock is gated.
  */
#define __HAL_RCC_GET_PLL12_SOURCE() ((uint32_t)(RCC->RCK12SELR & RCC_RCK12SELR_PLL12SRC))

/**
  * @brief  Macro to configure PLL1 multiplication and division factors.
  * @note   This function must be used only when the PLL1 is disabled.
  *
  * @param  __PLLM1__: specifies the division factor for PLL VCO input clock
  *          This parameter must be a number between 1 and 64
  * @note   You have to set the PLLM1 parameter correctly to ensure that the VCO input
  *         frequency ranges from 8 to 16 MHz
  * @param  __PLLN1__: specifies the multiplication factor for PLL VCO output clock
  *          This parameter must be a number between 25 and 100
  * @note   You have to set the PLLN parameter correctly to ensure that the VCO
  *         output frequency is between 800 to 1600 MHz
  * @param  __PLLP1__: specifies the division factor for the PLL1 P output
  *          This parameter must be a number in the range 1 to 128
  * @param  __PLLQ1__: specifies the division factor for for the PLL1 Q output
  *          This parameter must be in the range 1 to 128
  * @param  __PLLR1__: specifies the division factor for for the PLL1 R output
  *          This parameter must be in the range 1 to 128
  * @retval None
  */
#define __HAL_RCC_PLL1_CONFIG(__PLLM1__, __PLLN1__, __PLLP1__, __PLLQ1__,__PLLR1__ ) \
                  do{  MODIFY_REG( RCC->PLL1CFGR1, (RCC_PLL1CFGR1_DIVN | RCC_PLL1CFGR1_DIVM1) , \
                                   ( (__PLLN1__ - 1U) | ( (__PLLM1__ - 1U) << 16U) ) );  \
                       MODIFY_REG( RCC->PLL1CFGR2, (RCC_PLL1CFGR2_DIVP | RCC_PLL1CFGR2_DIVQ | RCC_PLL1CFGR2_DIVR), \
                                   ( (__PLLP1__ - 1U) | ( (__PLLQ1__ - 1U) <<8U ) | ( (__PLLR1__ - 1U) <<16U) )); \
                    } while(0)



/**
  * @brief  Macro to configure the PLL1 clock Fractional Part Of The Multiplication Factor
  *
  * @note   These bits can be written at any time, allowing dynamic fine-tuning of the PLL1 VCO
  *
  * @param  __RCC_PLL1FRACV__: specifies Fractional Part Of The Multiplication Factorfor PLL1 VCO
  *            It should be a value between 0 and 8191 ((2^13)-1)
  * @note   Warning: the software has to set correctly these bits to insure that the VCO
  *               output frequency is between its valid frequency range, which is: 800 to 1600 MHz
  * @retval None
  */
#define  __HAL_RCC_PLL1FRACV_CONFIG(__RCC_PLL1FRACV__) \
                   MODIFY_REG(RCC->PLL1FRACR, RCC_PLL1FRACR_FRACV,\
                             (uint32_t)(__RCC_PLL1FRACV__) << RCC_PLL1FRACR_FRACV_Pos)


/** @brief  Macros to enable or disable the Spread Spectrum Clock Generator of PLL1
  */
#define  __HAL_RCC_PLL1_SSMODE_ENABLE()    SET_BIT(RCC->PLL1CR, RCC_PLL1CR_SSCG_CTRL)

#define  __HAL_RCC_PLL1_SSMODE_DISABLE()   CLEAR_BIT(RCC->PLL1CR, RCC_PLL1CR_SSCG_CTRL)


