zephyrproject-rtos/zephyr/ext/hal/st/stm32cube/stm32mp1xx/drivers/include/stm32mp1xx_hal_rcc.h
#define  __HAL_RCC_PLL3_SSMODE_DISABLE()   CLEAR_BIT(RCC->PLL3CR, RCC_PLL3CR_SSCG_CTRL)


/** @brief  Macro to config the PLL3 Clock Spreading Generator
  * @param  __RCC_PLL3_MOD_PER__:       Modulation Period Adjustment for PLL3
  *          This parameter must have a value between 1 and 8191
  *
  * @param  __RCC_PLL3_TPDFN_DIS__:      Dithering TPDF noise control
  *          This parameter can be one of the following values:
  *            @arg RCC_TPDFN_DIS_ENABLED: Dithering noise injection enabled (default after reset)
  *            @arg RCC_TPDFN_DIS_DISABLED:  Dithering noise injection disabled

  * @param  __RCC_PLL3_RPDFN_DIS__:      Dithering TPDF noise control
  *          This parameter can be one of the following values:
  *            @arg RCC_RPDFN_DIS_ENABLED: Dithering noise injection enabled (default after reset)
  *            @arg RCC_RPDFN_DIS_DISABLED: Dithering noise injection disabled
  *
  *
  * @param  __RCC_PLL3_SSCG_MODE__:     Spread spectrum clock generator mode
  *          This parameter can be one of the following values:
  *            @arg RCC_SSCG_CENTER_SPREAD:  Center-spread modulation selected (default after reset)
  *            @arg RCC_SSCG_DOWN_SPREAD:    Down-spread modulation selected
  *
  * @param  __RCC_PLL3_INC_STEP__:   Modulation Depth Adjustment for PLL3
  *          This parameter must have a value between 1 and 32767
  *
  * @note   MOD_PER x INC_STEP shall not exceed (2^15)-1
  * @retval None
  */
#define __HAL_RCC_PLL3CSGCONFIG(__RCC_PLL3_MOD_PER__, __RCC_PLL3_TPDFN_DIS__, __RCC_PLL3_RPDFN_DIS__, \
                                __RCC_PLL3_SSCG_MODE__, __RCC_PLL3_INC_STEP__ ) \
                  do{  MODIFY_REG( RCC->PLL3CSGR, (RCC_PLL3CSGR_MOD_PER | RCC_PLL3CSGR_TPDFN_DIS | RCC_PLL3CSGR_RPDFN_DIS | \
                                                   RCC_PLL3CSGR_SSCG_MODE | RCC_PLL3CSGR_INC_STEP) , \
                                   (__RCC_PLL3_MOD_PER__ | __RCC_PLL3_TPDFN_DIS__ | __RCC_PLL3_RPDFN_DIS__ | \
                                    __RCC_PLL3_SSCG_MODE__ | (__RCC_PLL3_INC_STEP__ << RCC_PLL3CSGR_INC_STEP_Pos)) ) ;  \
                     } while(0)


/**
  * @brief  Macro to configure PLL3 clock source
  * @note   This function must be used only when the PLL is disabled.
  *
  * @param  __RCC_PLL3SOURCE__: specifies the PLL3 entry clock source.
  *          This parameter can be one of the following values:
  *            @arg RCC_PLL3SOURCE_HSI: HSI oscillator clock selected as PLL3 clock entry
  *            @arg RCC_PLL3SOURCE_HSE: HSE oscillator clock selected as PLL3 clock entry
  *            @arg RCC_PLL3SOURCE_CSI: HSE oscillator clock selected as PLL3 clock entry
  *            @arg RCC_PLL3SOURCE_OFF: No clock send to DIVMx divider and PLL
  * @retval None
  */
#define __HAL_RCC_PLL3_SOURCE(__RCC_PLL3SOURCE__ ) \
                  do{ MODIFY_REG( RCC->RCK3SELR, RCC_RCK3SELR_PLL3SRC, __RCC_PLL3SOURCE__ );  \
                  } while(0)

/** @brief  Macro to get the clock source used as PLL3 clock.
  * @retval The clock source used as PLL3 clock. The returned value can be one
  *         of the following:
  *             - RCC_PLL3SOURCE_HSI:  HSI used as PLL3 clock.
  *             - RCC_PLL3SOURCE_HSE:  HSE used as PLL3 clock.
  *             - RCC_PLL3SOURCE_CSI:  CSI used as PLL3 clock.
  *             - RCC_PLL3SOURCE_OFF:  PLL3 clock is gated.
  */
#define __HAL_RCC_GET_PLL3_SOURCE() ((uint32_t)(RCC->RCK3SELR & RCC_RCK3SELR_PLL3SRC))

/**
  * @brief  Macro to configure PLL3 multiplication and division factors.
  * @note   This function must be used only when the PLL3 is disabled.
  *
  * @param  __PLLM3__: specifies the division factor for PLL VCO input clock
  *          This parameter must be a number between 1 and 64
  * @note   You have to set the PLLM1 parameter correctly to ensure that the VCO input
  *         frequency ranges from 4 to 16 MHz
  * @param  __PLLN3__: specifies the multiplication factor for PLL VCO output clock
  *          This parameter must be a number between 25 and 200
  * @note   You have to set the PLLN parameter correctly to ensure that the VCO
  *         output frequency is between 400 to 800 MHz
  * @param  __PLLP3__: specifies the division factor for the PLL3 P output
  *          This parameter must be a number in the range 1 to 128
  * @param  __PLLQ3__: specifies the division factor for for the PLL3 Q output
  *          This parameter must be in the range 1 to 128
  * @param  __PLLR3__: specifies the division factor for for the PLL3 R output
  *          This parameter must be in the range 1 to 128
  * @retval None
  */
#define __HAL_RCC_PLL3_CONFIG(__PLLM3__, __PLLN3__, __PLLP3__, __PLLQ3__,__PLLR3__ ) \
                  do{  MODIFY_REG( RCC->PLL3CFGR1, (RCC_PLL3CFGR1_DIVN | RCC_PLL3CFGR1_DIVM3) , \
                                   ( (__PLLN3__ - 1U) | ( (__PLLM3__ - 1U) << 16U) ) );  \
                       MODIFY_REG( RCC->PLL3CFGR2, (RCC_PLL3CFGR2_DIVP | RCC_PLL3CFGR2_DIVQ | RCC_PLL3CFGR2_DIVR), \
                                   ( (__PLLP3__ - 1U) | ( (__PLLQ3__ - 1U) <<8U ) | ( (__PLLR3__ - 1U) <<16U) )); \
                    } while(0)

/**
  * @brief  Macro to configure the PLL3 clock Fractional Part Of The Multiplication Factor
  *
  * @note   These bits can be written at any time, allowing dynamic fine-tuning of the PLL3 VCO
  *
  * @param  __RCC_PLL3FRACV__: specifies Fractional Part Of The Multiplication Factorfor PLL3 VCO
  *           It should be a value between 0 and 8191 ((2^13)-1)
  * @note   Warning: the software has to set correctly these bits to insure that the VCO
  *         output frequency is between its valid frequency range, which is: 400 to 800 MHz
  * @retval None
  */
#define  __HAL_RCC_PLL3FRACV_CONFIG(__RCC_PLL3FRACV__) \
                   MODIFY_REG(RCC->PLL3FRACR, RCC_PLL3FRACR_FRACV, \
                             (uint32_t)(__RCC_PLL3FRACV__) << RCC_PLL3FRACR_FRACV_Pos)


/** @brief  Macro to select  the PLL3  input frequency range.
  * @param  __RCC_PLL3IFRange__: specifies the PLL3 input frequency range
  *         This parameter can be one of the following values:
  *            @arg RCC_PLL3IFRANGE_0: Range frequency is between 4 and 8 MHz (default after reset)
  *            @arg RCC_PLL3IFRANGE_1: Range frequency is between 8 and 16 MHz
  * @retval None
  */
#define __HAL_RCC_PLL3_IFRANGE(__RCC_PLL3IFRange__) \
                     MODIFY_REG(RCC->PLL3CFGR1, RCC_PLL3CFGR1_IFRGE, (__RCC_PLL3IFRange__))


/** @brief  Macros to enable or disable the PLL4.
  * @note   After enabling the main PLL, the application software should wait on
  *         PLLRDY flag to be set indicating that PLL clock is stable and can
  *         be used as system clock source.
  * @note   The PLL4 can not be disabled if it is used as MPU clock source
  * @note   The PLL4 is disabled by hardware when entering STOP and STANDBY modes.
  */
#define __HAL_RCC_PLL4_ENABLE()     SET_BIT(RCC->PLL4CR, RCC_PLL4CR_PLLON )
#define __HAL_RCC_PLL4_DISABLE()    CLEAR_BIT(RCC->PLL4CR, RCC_PLL4CR_PLLON)

/**
  * @brief  Enables or disables each clock output
  * @note   Enabling/disabling  Those Clocks outputs can be disabled anytime  without the need to stop the PLL,
  *         with the exception of ck_pll_p  cannot be stopped if used as MPU Clock
  * @param  __RCC_PLL4ClockOut__: specifies the PLL clock to be outputed
  *          This parameter can be one of the following values:
  *            @arg RCC_PLL4_DIVP
  *            @arg RCC_PLL4_DIVQ
  *            @arg RCC_PLL4_DIVR
  * @retval None
  */
#define __HAL_RCC_PLL4CLKOUT_ENABLE(__RCC_PLL4ClockOut__)       SET_BIT(RCC->PLL4CR, __RCC_PLL4ClockOut__ )

#define __HAL_RCC_PLL4CLKOUT_DISABLE(__RCC_PLL4ClockOut__)      CLEAR_BIT(RCC->PLL4CR, __RCC_PLL4ClockOut__ )


/**
  * @brief  Enables or disables Fractional Part Of The Multiplication Factor of PLL4 VCO
  * @note   Enabling/disabling  Fractional Part can be done anytime  without the need to stop the PLL4
  * @retval None
  */

